# [Titanic Dataset](https://www.kaggle.com/competitions/titanic)
---
(Yay, I love analysing disastrous outcomes where thousands of people died ðŸ¥°)

In [1]:
# !kaggle competitions download -c titanic
# !unzip titanic.zip
# !rm -rf titanic.zip

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
df_train = pd.read_csv("train.csv", index_col="PassengerId")
print(df_train.shape)
df_train.head()

(891, 11)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df_test = pd.read_csv("test.csv", index_col="PassengerId")
print(df_test.shape)
df_test.head()

(418, 10)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [5]:
df = pd.concat([df_train, df_test], axis=0)
df.iloc[889:899]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
890,1.0,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0.0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
892,NaN,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,NaN,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,NaN,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,NaN,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,NaN,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
897,NaN,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
898,NaN,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
899,NaN,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S

## Data Cleaning
---

In [6]:
df.drop(columns=["Name", "Ticket"], inplace=True)
df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
PassengerId,,,,,,,,,
1,0.0,3,male,22.0,1,0,7.2500,NaN,S
2,1.0,1,female,38.0,1,0,71.2833,C85,C
3,1.0,3,female,26.0,0,0,7.9250,NaN,S
4,1.0,1,female,35.0,1,0,53.1000,C123,S
5,0.0,3,male,35.0,0,0,8.0500,NaN,S

In [7]:
df.drop("Survived", axis=1).isna().any()

Pclass      False
Sex         False
Age          True
SibSp       False
Parch       False
Fare         True
Cabin        True
Embarked     True
dtype: bool

In [8]:
df.drop("Survived", axis=1).isna().sum()

Pclass         0
Sex            0
Age          263
SibSp          0
Parch          0
Fare           1
Cabin       1014
Embarked       2
dtype: int64

In [9]:
df.drop("Survived", axis=1).isna().sum() * 100 / df.shape[0]

Pclass       0.000000
Sex          0.000000
Age         20.091673
SibSp        0.000000
Parch        0.000000
Fare         0.076394
Cabin       77.463713
Embarked     0.152788
dtype: float64

Mkc Cabin m Majority toh null hi hai kaam kya iska?

In [10]:
df.drop("Cabin", axis=1, inplace=True)
df.head(3)

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                 0.0       3    male  22.0      1      0   7.2500        S
2                 1.0       1  female  38.0      1      0  71.2833        C
3                 1.0       3  female  26.0      0      0   7.9250        S

In [11]:
df.shape

(1309, 8)

`Embarked` and `Fare` have a really low percentage of null values... are these in train or test set?

In [12]:
df[["Fare", "Embarked"]].isna().any(axis=1)

PassengerId
1       False
2       False
3       False
4       False
5       False
        ...
1305    False
1306    False
1307    False
1308    False
1309    False
Length: 1309, dtype: bool

In [13]:
df[df[["Fare", "Embarked"]].isna().any(axis=1)]

             Survived  Pclass     Sex   Age  SibSp  Parch  Fare Embarked
PassengerId
62                1.0       1  female  38.0      0      0  80.0      NaN
830               1.0       1  female  62.0      0      0  80.0      NaN
1044              NaN       3    male  60.5      0      0   NaN        S

Let's only remove the **train set**!

In [14]:
df[(df[["Fare", "Embarked"]].isna().any(axis=1)) & df["Survived"].notna()]

             Survived  Pclass     Sex   Age  SibSp  Parch  Fare Embarked
PassengerId
62                1.0       1  female  38.0      0      0  80.0      NaN
830               1.0       1  female  62.0      0      0  80.0      NaN

In [15]:
df.drop(
    df[(df[["Fare", "Embarked"]].isna().any(axis=1)) & df["Survived"].notna()].index,
    axis=0,
    inplace=True,
)
df.shape

(1307, 8)

In [ ]:
df[df[["Fare", "Embarked"]].isna().any(axis=1)]

             Survived  Pclass   Sex   Age  SibSp  Parch  Fare Embarked
PassengerId
1044              NaN       3  male  60.5      0      0   NaN        S

Can fill in this test row's Fare with just a median. Might become weird, but it's just one row.

In [47]:
df["Fare"].fillna(df["Fare"].median(), inplace=True)
df.drop("Survived", axis=1).isna().sum() * 100 / df.shape[0]

Pclass       0.000000
Sex          0.000000
Age         20.122418
SibSp        0.000000
Parch        0.000000
Fare         0.000000
Embarked     0.000000
dtype: float64

20% of ages are null, hmmmmmmm.... train set?

In [48]:
df.groupby(df["Survived"].isna().map({True: "Test Data", False: "Train Data"}))[
    "Age"
].apply(lambda col: col.isna().sum()).reset_index(name="Age Null Count")

     Survived  Age Null Count
0   Test Data              86
1  Train Data             177

I have 2 methods in mind:-
1. `fillna(df['Age'].mean())`
2. **BETTER METHOD:** Fit a regression model later (e.g., RandomForestRegressor) on known Age values using features, then predict Age for missing rows!

### Duplicates

In [54]:
df.duplicated().any()

np.True_

## Using MODEL-BASED IMPUTATION to handle null in `Age`

In [51]:
impute_train = df[df["Age"].notna() & df["Survived"].notna()].drop("Survived", axis=1)
impute_train

             Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                 3    male  22.0      1      0   7.2500        S
2                 1  female  38.0      1      0  71.2833        C
3                 3  female  26.0      0      0   7.9250        S
4                 1  female  35.0      1      0  53.1000        S
5                 3    male  35.0      0      0   8.0500        S
...             ...     ...   ...    ...    ...      ...      ...
886               3  female  39.0      0      5  29.1250        Q
887               2    male  27.0      0      0  13.0000        S
888               1  female  19.0      0      0  30.0000        S
890               1    male  26.0      0      0  30.0000        C
891               3    male  32.0      0      0   7.7500        Q

[712 rows x 7 columns]